# Subsetting `pd.DataFrame`
2023-10-09

there are *many* ways to subset a data frame.

We'll review some core methods to do this


## Our data
We will use simplified data from the National Snow and Ice Data Center. Column descriptions:


- **year**: calendar year
- **europe - antarctica**: change in glacial volume (km3) in each region that year
- **global_glacial_volume_change**: cumulative global glacial volume change (km3), starting in 1961
- **annual_sea_level_rise**: annual rise in sea level (mm)
- **cumulative_sea_level_rise**: cumulative rise in sea level (mm) since 1961

Let's read in the data!

In [1]:
import pandas as pd
import numpy as np

In [4]:
# read in file

df = pd.read_csv('glacial_loss.csv')

# see the first 5 rows
df.head()

,year,europe,arctic,alaska,asia,north_america,south_america,antarctica,global_glacial_volume_change,annual_sea_level_rise,cumulative_sea_level_rise
0,1961,-5.128903,-108.382987,-18.721190,-32.350759,-14.359007,-4.739367,-35.116389,-220.823515,0.610010,0.610010
1,1962,5.576282,-173.252450,-24.324790,-4.675440,-2.161842,-13.694367,-78.222887,-514.269862,0.810625,1.420635
2,1963,-10.123105,-0.423751,-2.047567,-3.027298,-27.535881,3.419633,3.765109,-550.575640,0.100292,1.520927
3,1964,-4.508358,20.070148,0.477800,-18.675385,-2.248286,20.732633,14.853096,-519.589859,-0.085596,1.435331
4,1965,10.629385,43.695389,-0.115332,-18.414602,-19.398765,6.862102,22.793484,-473.112003,-0.128392,1.306939

In [9]:
# get number of rows and columns
# 43 rows, 11 columns
df.shape

(43, 11)

In [5]:
# get column names

df.columns

Index(['year', 'europe', 'arctic', 'alaska', 'asia', 'north_america',
       'south_america', 'antarctica', 'global_glacial_volume_change',
       'annual_sea_level_rise', 'cumulative_sea_level_rise'],
      dtype='object')

In [10]:
# unfo about non-null values and dtype of columns
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43 entries, 0 to 42
Data columns (total 11 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   year                          43 non-null     int64
 1   europe                        43 non-null     float64
 2   arctic                        43 non-null     float64
 3   alaska                        43 non-null     float64
 4   asia                          43 non-null     float64
 5   north_america                 43 non-null     float64
 6   south_america                 43 non-null     float64
 7   antarctica                    43 non-null     float64
 8   global_glacial_volume_change  43 non-null     float64
 9   annual_sea_level_rise         43 non-null     float64
 10  cumulative_sea_level_rise     43 non-null     float64
dtypes: float64(10), int64(1)
memory usage: 3.8 KB

In [7]:
# check the data types of each column

df.dtypes

year                              int64
europe                          float64
arctic                          float64
alaska                          float64
asia                            float64
north_america                   float64
south_america                   float64
antarctica                      float64
global_glacial_volume_change    float64
annual_sea_level_rise           float64
cumulative_sea_level_rise       float64
dtype: object

# Selecting a single column...

## ...by column name

This is the simplest case for selecting data. Suppose we are interested in the annual sea level rise. Then we can access that single column in this way:

```
df['column_name']
```

Note: this is the same suntax for a dictionary. Remember we can think of a `pd.DataFrame` as a dictionary where the keys are the column names. 


Example: sea level rise

In [14]:
# select a single column by using square brackets

annual_rise = df['annual_sea_level_rise']

# check the type of the output
print(type(annual_rise))

annual_rise.head()

<class 'pandas.core.series.Series'>

0    0.610010
1    0.810625
2    0.100292
3   -0.085596
4   -0.128392
Name: annual_sea_level_rise, dtype: float64

Since we only selected a single column the output is a `pandas.Series`.

`df['column_name']` is an example of selecting **by label**


**selecting by label**, which means we want to select data from our data frame using the *names* of the columns, not their *position*.

## ... with attribute syntax

`df.column_name`

In [16]:
annual_rise_2 = df.annual_sea_level_rise
annual_rise_2.head()

0    0.610010
1    0.810625
2    0.100292
3   -0.085596
4   -0.128392
Name: annual_sea_level_rise, dtype: float64

In [18]:
#df.annual_sea_level_rise

# Selecting multiple columns...


## ... using a list of column names


This is another example of selecting by labels. We just need to pass a list with the column names to the square brackets []. 



```
df[['col_1', 'col_2', 'col_3']]
```

The list of column names `['col_1', 'col_2', etc.]` goes inside the selection brackets `[]`

Notice each column name is a string. 



For example, say we want to look at the change in glacial volume in Europe and Asia, then we can select those columns like this:

In [21]:
# select columns with names "europe" and "asia"

europe_asia = df[['europe', 'asia']]

# double brackets because we're passing the list ['europe', 'asia'] 
# to the selection brackets []

In [24]:
# check the type of the resulting selection
print(type(europe_asia))

# check the shape of the selection
print((europe_asia.shape))
# 43 rows, 2 columns

<class 'pandas.core.frame.DataFrame'>
(43, 2)

## ... using a slice

Yet another example of selecting by label! In this case we will use the `loc` selection. 

`loc` is short for "locate" :)

The general syntax is:

```
df.loc[ row-selection , column-selection]
```



where `row-selection` and `column-selection` are the rows and columns we want to subset from the data frame.

format for indexing:

```
df.loc[:(if we want all rows) , 'start_col_name':'stop_col_name(inclusive)']

```

Let’s start by a simple example, where we want to select a slice of columns, say the change in glacial volume per year in all regions. This corresponds to all columns between `europe` and `antarctica`. (arctic to antarctica in the textbook)

In [30]:
# select all columns between 'europe' and 'antarctica'

all_regions = df.loc[: , 'europe':'antarctica']



print(all_regions.shape)

print(type(all_regions))

all_regions.head()

(43, 6)
<class 'pandas.core.frame.DataFrame'>

       arctic     alaska       asia  north_america  south_america  antarctica
0 -108.382987 -18.721190 -32.350759     -14.359007      -4.739367  -35.116389
1 -173.252450 -24.324790  -4.675440      -2.161842     -13.694367  -78.222887
2   -0.423751  -2.047567  -3.027298     -27.535881       3.419633    3.765109
3   20.070148   0.477800 -18.675385      -2.248286      20.732633   14.853096
4   43.695389  -0.115332 -18.414602     -19.398765       6.862102   22.793484

Notice two things:

we used the colon : as the `row-selection` parameter, which means “select all the rows”
the slice of the data frame we got includes both endpoints of the slice `europe`:`antarctica`. In other words we get the `europe` column and the `antarctica` column. This is different from how slicing works in base Python and NumPy, where the end point is not included.


- `row-selection` = ':' colon = means select all rows
- `column-selection`  = slice 'europe:antarctica'
- we get both ends of the slice in the selected dataframe. This is different from slicing in base Python and NumPy, where the endpoint is not included.

### Check-in:


select the following from `df`:

- year data
- data from Arctic, Alaska, Asia, North America
- global change in glacial volume and cumulative sea rise

In [39]:
# year data
year_data = df.year
year_data.head()

0    1961
1    1962
2    1963
3    1964
4    1965
Name: year, dtype: int64

In [35]:
# data from Arctic, Alaska, Asia, North America
selected_regions = df.loc[: , 'arctic':'north_america']
selected_regions.head()

       arctic     alaska       asia  north_america
0 -108.382987 -18.721190 -32.350759     -14.359007
1 -173.252450 -24.324790  -4.675440      -2.161842
2   -0.423751  -2.047567  -3.027298     -27.535881
3   20.070148   0.477800 -18.675385      -2.248286
4   43.695389  -0.115332 -18.414602     -19.398765

In [38]:
#  global change in glacial volume and cumulative sea rise

glacial_cumulative = df[['global_glacial_volume_change', 'cumulative_sea_level_rise']]
glacial_cumulative.head()

   global_glacial_volume_change  cumulative_sea_level_rise
0                   -220.823515                   0.610010
1                   -514.269862                   1.420635
2                   -550.575640                   1.520927
3                   -519.589859                   1.435331
4                   -473.112003                   1.306939

# Selecting rows ...


## ... using a condition

Selecting which rows satisfy a particular condition is, in my experience, the most usual kind of row subsetting. The general syntax for this type of selection is `df[condition_on_rows]`. For example, suppose we are intersted in all data after 1996. We can select those rows in this way: